app/controllers/dice_controller.rb

INSERT INTO "rolls" ("created_at", "updated_at", "value") VALUES('2009-12-08 08:12:48', '2009-12-08 08:12:48', 6)
---
	def shake
		dice = Dice.new
		@result = dice.shake
		roll = Roll.new
		roll.value = @result
		roll.save

SELECT count(*) AS count_all, value AS value FROM "rolls" GROUP BY value
SELECT * FROM "rolls"
---
	def report
		@report =  Roll.count
		@statistics = Roll.count(:group => :value)